Repository: hocgin/ErrorKit
Catalog: Sources/ErrorKit/Resources/Localizable.xcstrings
Source language: en
Languages: ar, bg, ca, cs, da, de, el, es, es_419, fi, fr, fr_ca, he, hi, hr, hu, id, it, ja, kk, ko, ms, nb, nl, pl, pt_br, pt_pt, ro, ru, sk, sv, th, tr, uk, vi, zh_hans, zh_hant, zh_hk

# BuiltInErrors.ValidationError.inputTooLong
source: The %1$@ field cannot be longer than %2$lld characters. Please shorten your input and try again.
ar: لا يمكن أن يتجاوز حقل %1$@ %2$lld حرفًا. يرجى تقصير الإدخال والمحاولة مرة أخرى.
bg: Полето %1$@ не може да бъде по-дълго от %2$lld знака. Моля, съкратете вашия вход и опитайте отново.
ca: El camp %1$@ no pot tenir més de %2$lld caràcters. Si us plau, escurça la teva entrada i prova-ho de nou.
cs: Pole %1$@ nesmí být delší než %2$lld znaků. Prosím zkrať svůj vstup a zkus to znovu.
da: %1$@-feltet kan ikke være længere end %2$lld tegn. Forkort venligst din indtastning og prøv igen.
de: Das %1$@-Feld darf nicht länger als %2$lld Zeichen sein. Bitte verkürze deine Eingabe und versuche es erneut.
el: Το πεδίο %1$@ δεν μπορεί να έχει μήκος μεγαλύτερο από %2$lld χαρακτήρες. Παρακαλώ συντομεύστε την είσοδό σας και δοκιμάστε ξανά.
es: El campo %1$@ no puede tener más de %2$lld caracteres. Por favor, acorta tu entrada e inténtalo de nuevo.
es_419: El campo %1$@ no puede tener más de %2$lld caracteres. Por favor, acorta tu entrada y vuelve a intentarlo.
fi: %1$@-kenttä ei voi olla pidempi kuin %2$lld merkkiä. Lyhennä syötettäsi ja yritä uudelleen.
fr: Le champ %1$@ ne peut pas contenir plus de %2$lld caractères. Veuillez raccourcir votre saisie et réessayez.
fr_ca: Le champ %1$@ ne peut pas dépasser %2$lld caractères. Veuillez raccourcir votre saisie et réessayez.
he: שדה %1$@ לא יכול להכיל יותר מ-%2$lld תווים. אנא קצוב את הקלט שלך ונסה שוב.
hi: %1$@ फ़ील्ड %2$lld वर्णों से लंबा नहीं हो सकता। कृपया अपने इनपुट को छोटा करें और फिर से प्रयास करें।
hr: Polje %1$@ ne može biti duže od %2$lld znakova. Molimo skratite unos i pokušajte ponovo.
hu: A(z) %1$@ mező nem lehet hosszabb, mint %2$lld karakter. Kérlek, rövidítsd le a bevitelt, és próbáld újra.
id: Kolom %1$@ tidak boleh lebih dari %2$lld karakter. Harap pendekkan input Anda dan coba lagi.
it: Il campo %1$@ non può essere lungo più di %2$lld caratteri. Accorcia l'input e riprova.
ja: このフィールドは%2$lld文字を超えることはできません。入力を短くして再試行してください。
kk: %1$@ өрісі %2$lld таңбадан ұзын болмауы тиіс. Кірісіңізді қысқартуға тырысыңыз.
ko: %1$@ 필드는 %2$lld자 이상으로 입력할 수 없습니다. 입력 내용을 줄이고 다시 시도해 주십시오.
ms: Bahan %1$@ tidak boleh melebihi %2$lld aksara. Sila pendekkan input anda dan cuba lagi.
nb: %1$@ feltet kan ikke være lenger enn %2$lld tegn. Vennligst forkort innholdet ditt og prøv igjen.
nl: Het %1$@ veld mag niet langer zijn dan %2$lld tekens. Verkort je invoer en probeer het opnieuw.
pl: Pole %1$@ nie może być dłuższe niż %2$lld znaków. Proszę skrócić swoje dane wejściowe i spróbować ponownie.
pt_br: O campo %1$@ não pode ter mais do que %2$lld caracteres. Por favor, encurte sua entrada e tente novamente.
pt_pt: O campo %1$@ não pode ter mais de %2$lld caracteres. Por favor, reduza a entrada e tente novamente.
ro: Câmpul %1$@ nu poate fi mai lung de %2$lld caractere. Te rog, scurtează introducerea și încearcă din nou.
ru: Поле %1$@ не может содержать более %2$lld символов. Пожалуйста, сократите ваш ввод и попробуйте снова.
sk: Prosím, skráťte svoj vstup a skúste to znovu.
sv: Vänligen förkorta din inmatning och försök igen.
th: ฟิลด์ %1$@ ต้องไม่ยาวเกิน %2$lld ตัวอักษร กรุณาลดความยาวข้อมูลของคุณแล้วลองอีกครั้ง
tr: %1$@ alanı %2$lld karakterden uzun olamaz. Lütfen girişinizi kısaltın ve tekrar deneyin.
uk: Поле %1$@ не може бути довшим за %2$lld символів. Будь ласка, скоротіть ваш ввід і спробуйте ще раз.
vi: Trường %1$@ không được dài hơn %2$lld ký tự. Vui lòng rút ngắn nhập liệu của bạn và thử lại.
zh_hans: %1$@ 字段的长度不能超过 %2$lld 个字符。请缩短您的输入并重试。
zh_hant: %1$@ 欄位不能超過 %2$lld 個字符，請縮短您的輸入後再試一次。
zh_hk: 請縮短您的輸入，再試一次。

# BuiltInErrors.ValidationError.invalidInput
source: The value entered for %@ is not in the correct format. Please review the requirements and try again.
ar: القيمة المدخلة لـ %@ ليست بالشكل الصحيح. يرجى مراجعة المتطلبات والمحاولة مرة أخرى.
bg: Въведеното значение за %@ не е в правилния формат. Моля, прегледайте изискванията и опитайте отново.
ca: El valor introduït per a %@ no té el format correcte. Si us plau, revisa els requisits i prova-ho de nou.
cs: Zadaná hodnota pro %@ není ve správném formátu. Zkontroluj prosím požadavky a zkus to znovu.
da: Den indtastede værdi for %@ er ikke i det korrekte format. Gennemgå venligst kravene og prøv igen.
de: Der eingegebene Wert für %@ hat nicht das richtige Format. Bitte überprüfe die Anforderungen und versuche es erneut.
el: Η τιμή που εισάγατε για %@ δεν είναι στη σωστή μορφή. Παρακαλώ ελέγξτε τις απαιτήσεις και δοκιμάστε ξανά.
es: Por favor, revisa los requisitos y vuelve a intentarlo.
es_419: El valor ingresado para %@ no está en el formato correcto. Revisa los requisitos y vuelve a intentarlo.
fi: Syöte %@ ei ole oikeassa muodossa. Tarkista vaatimukset ja yritä uudelleen.
fr: La valeur saisie pour %@ n'est pas au format correct. Veuillez vérifier les exigences et réessayer.
fr_ca: La valeur saisie pour %@ n'est pas au bon format. Veuillez vérifier les exigences et réessayez.
he: הערך שהוזן עבור %@ אינו בפורמט הנכון. אנא עיין בדרישות ונסה שוב.
hi: %@ के लिए डाला गया मान सही प्रारूप में नहीं है। कृपया आवश्यकताओं की समीक्षा करें और फिर से प्रयास करें।
hr: Unesena vrijednost za %@ nije u ispravnom formatu. Provjerite zahtjeve i pokušajte ponovo.
hu: A(z) %@ mezőbe beírt érték nincs a megfelelő formátumban. Kérlek, ellenőrizd a követelményeket, és próbáld újra.
id: Nilai yang dimasukkan untuk %@ tidak dalam format yang benar. Harap periksa persyaratan dan coba lagi.
it: Il valore inserito per %@ non è nel formato corretto. Controlla i requisiti e riprova.
ja: %@の値が正しい形式ではありません。要件を確認し、もう一度試してください。
kk: %@ үшін енгізілген мән дұрыс форматта емес. Талаптарды қайта қарастырыңыз және қайтадан барыңыз.
ko: %@에 대한 입력 값이 올바른 형식이 아닙니다. 요구 사항을 검토하고 다시 시도해 주십시오.
ms: Nilai yang dimasukkan untuk %@ tidak dalam format yang betul. Sila semak keperluan dan cuba lagi.
nb: Verdien for %@ er ikke i riktig format. Vennligst se over kravene og prøv igjen.
nl: De waarde die voor %@ is ingevoerd, is niet in het juiste formaat. Bekijk de vereisten en probeer het opnieuw.
pl: Wprowadzona wartość dla %@ nie jest w poprawnym formacie. Proszę sprawdzić wymagania i spróbować ponownie.
pt_br: O valor inserido para %@ não está no formato correto. Por favor, revise os requisitos e tente novamente.
pt_pt: O valor introduzido para %@ não está no formato correto. Por favor, reveja os requisitos e tente novamente.
ro: Valoarea introdusă pentru %@ nu este în formatul corect. Te rog, revizuiește cerințele și încearcă din nou.
ru: Введённое значение для %@ не соответствует правильному формату. Пожалуйста, проверьте требования и попробуйте снова.
sk: Zadaná hodnota pre %@ nie je vo správnom formáte. Prosím, skontrolujte požiadavky a skúste to znovu.
sv: Värdet som angavs för %@ är inte i rätt format. Vänligen kontrollera kraven och försök igen.
th: ค่าที่กรอกสำหรับ %@ ไม่อยู่ในรูปแบบที่ถูกต้อง กรุณาตรวจสอบข้อกำหนดและลองอีกครั้ง
tr: %@ için girilen değer doğru formatta değil. Lütfen gereksinimleri gözden geçirin ve tekrar deneyin.
uk: Введене значення для %@ не відповідає правильному формату. Будь ласка, перегляньте вимоги і спробуйте ще раз.
vi: Giá trị được nhập cho %@ không đúng định dạng. Vui lòng xem lại các yêu cầu và thử lại.
zh_hans: 输入的 %@ 值格式不正确。请检查要求并重试。
zh_hant: 輸入的 %@ 值格式不正確。請檢查要求後再試一次。
zh_hk: 輸入的%@值格式不正確。請檢查要求，然後再次嘗試。

# BuiltInErrors.ValidationError.missingField
source: Please provide a value for %@. This information is required to proceed.
ar: يرجى تقديم قيمة لـ %@. هذه المعلومات مطلوبة للمتابعة.
bg: Моля, предоставете стойност за %@. Тази информация е необходима, за да продължите.
ca: Si us plau, proporciona un valor per a %@. Aquesta informació és necessària per avançar.
cs: Prosím poskytni hodnotu pro %@. Tato informace je požadována pro pokračování.
da: Angiv venligst en værdi for %@. Denne information er nødvendig for at fortsætte.
de: Bitte gib einen Wert für %@ an. Diese Information ist erforderlich, um fortzufahren.
el: Παρακαλώ παρέχετε μια τιμή για %@. Αυτή η πληροφορία είναι απαραίτητη για να προχωρήσετε.
es: Es obligatorio proporcionarla para continuar.
es_419: Por favor, proporciona un valor para %@. Esta información es requerida para continuar.
fi: Anna arvo %@. Tämä tieto on pakollinen etenemistä varten.
fr: Veuillez fournir une valeur pour %@. Cette information est nécessaire pour continuer.
fr_ca: Veuillez fournir une valeur pour %@. Cette information est requise pour continuer.
he: אנא ספק ערך עבור %@. מידע זה הוא חובה להמשך.
hi: कृपया %@ के लिए एक मान प्रदान करें। इस जानकारी की आवश्यकता है ताकि आप आगे बढ़ सकें।
hr: Molimo navedite vrijednost za %@. Ova informacija je potrebna za nastavak.
hu: Kérlek, adj meg egy értéket a(z) %@ mezőhöz. Ez az információ szükséges a továbblépéshez.
id: Harap berikan nilai untuk %@. Informasi ini diperlukan untuk melanjutkan.
it: Fornisci un valore per %@. Queste informazioni sono necessarie per procedere.
ja: %@の値を提供してください。この情報は進むために必要です。
kk: %@ үшін мән беріңіз. Бұл ақпарат жалғастыру үшін қажет.
ko: %@에 대한 값이 필요합니다. 이 정보는 진행하기 위해 필요합니다.
ms: Sila berikan nilai untuk %@. Maklumat ini diperlukan untuk meneruskan.
nb: Vennligst oppgi en verdi for %@. Denne informasjonen er nødvendig for å fortsette.
nl: Geef een waarde op voor %@. Deze informatie is vereist om verder te gaan.
pl: Proszę podać wartość dla %@. Te informacje są wymagane, aby kontynuować.
pt_br: Por favor, forneça um valor para %@. Esta informação é obrigatória para prosseguir.
pt_pt: Por favor, forneça um valor para %@. Esta informação é obrigatória para prosseguir.
ro: Te rog să furnizezi o valoare pentru %@. Această informație este necesară pentru a continua.
ru: Пожалуйста, укажите значение для %@. Эта информация нужна для продолжения.
sk: Poskytnite hodnotu pre %@. Tieto informácie sú potrebné na pokračovanie.
sv: Vänligen ange ett värde för %@. Denna information är nödvändig för att gå vidare.
th: กรุณากรอกค่าที่ %@ ข้อมูลนี้จำเป็นสำหรับการดำเนินการต่อ
tr: Lütfen %@ için bir değer sağlayın. Bu bilgi, devam etmek için gereklidir.
uk: Будь ласка, надайте значення для %@. Ця інформація необхідна для продовження.
vi: Vui lòng cung cấp giá trị cho %@. Thông tin này là cần thiết để tiếp tục.
zh_hans: 请为 %@ 提供一个值。此信息是继续的必要条件。
zh_hant: 請為 %@ 提供一個值。此資訊為必填項，以便繼續進行。
zh_hk: 請提供%@的值。此信息是必需的才能繼續。

# EnhancedDescriptions.CocoaError.default
source: A file system error occurred: %@
ar: حدث خطأ في نظام الملفات: %@.
bg: Възникна грешка в файловата система: %@
ca: S'ha produït un error del sistema de fitxers: %@
cs: Došlo k chybě souborového systému: %@.
da: Der opstod en filsystemfejl: %@
de: Es ist ein Fehler im Dateisystem aufgetreten: %@
el: Παρουσιάστηκε ένα σφάλμα συστήματος αρχείων: %@
es: Ocurrió un error en el sistema de archivos: %@
es_419: Ocurrió un error en el sistema de archivos: %@
fi: Tapahtui tiedostojärjestelmävirhe: %@
fr: Une erreur de système de fichiers s'est produite : %@
fr_ca: Une erreur de système de fichiers s'est produite : %@
he: שגיאת מערכת קבצים התרחשה: %@
hi: फाइल सिस्टम त्रुटि हुई: %@
hr: Došlo je do greške u datotečnom sustavu: %@
hu: Fájlrendszeri hiba történt: %@
id: Terjadi kesalahan sistem file: %@
it: Si è verificato un errore nel file system: %@
ja: ファイルシステムエラーが発生しました: %@
kk: Файлдық жүйеде қате пайда болды: %@
ko: 파일 시스템 오류가 발생했습니다: %@
ms: Ralat sistem fail berlaku: %@
nb: Det oppstod en filsystemfeil: %@
nl: Er is een bestandssysteemfout opgetreden: %@
pl: Wystąpił błąd systemu plików: %@
pt_br: Ocorreu um erro no sistema de arquivos: %@
pt_pt: Ocorreu um erro no sistema de arquivos: %@
ro: A apărut o eroare a sistemului de fișiere: %@
ru: Произошла ошибка файловой системы: %@.
sk: Vyskytla sa chyba súborového systému: %@
sv: Ett filsystemfel inträffade: %@
th: เกิดข้อผิดพลาดในระบบไฟล์: %@
tr: Bir dosya sistemi hatası oluştu: %@
uk: Сталася помилка файлової системи: %@
vi: Đã xảy ra lỗi hệ thống tệp: %@
zh_hans: 发生文件系统错误：%@
zh_hant: 發生文件系統錯誤：%@。
zh_hk: 發生文件系統錯誤：%@

# EnhancedDescriptions.CocoaError.fileNoSuchFile
source: The file could not be found.
ar: تعذر العثور على الملف.
bg: Файлът не може да бъде намерен.
ca: No s'ha pogut trobar el fitxer.
cs: Soubor nebyl nalezen.
da: Filen kunne ikke findes.
de: Die Datei konnte nicht gefunden werden.
el: Δεν ήταν δυνατή η εύρεση του αρχείου.
es: No se pudo encontrar el archivo.
es_419: No se pudo encontrar el archivo.
fi: Tiedostoa ei löytynyt.
fr: Le fichier est introuvable.
fr_ca: Le fichier est introuvable.
he: לא ניתן היה למצוא את הקובץ.
hi: फाइल नहीं मिल सकी।
hr: Datoteka nije pronađena.
hu: A fájl nem található.
id: File tidak dapat ditemukan.
it: Il file non è stato trovato.
ja: ファイルが見つかりませんでした。
kk: Файл табылмады.
ko: 파일을 찾을 수 없습니다.
ms: Fail tidak dapat dijumpai.
nb: Filen ble ikke funnet.
nl: Het bestand kon niet worden gevonden.
pl: Nie można znaleźć pliku.
pt_br: Não foi possível encontrar o arquivo.
pt_pt: O ficheiro não foi encontrado.
ro: Fișierul nu a putut fi găsit.
ru: Файл не найден.
sk: Súbor sa nenašiel.
sv: Filen kunde inte hittas.
th: ไม่พบไฟล์ที่ระบุไว้
tr: Dosya bulunamadı.
uk: Файл не знайдено.
vi: Không tìm thấy tệp.
zh_hans: 无法找到该文件。
zh_hant: 找不到該檔案。
zh_hk: 找不到此文件。

# EnhancedDescriptions.CocoaError.fileReadNoPermission
source: You do not have permission to read this file.
ar: ليس لديك إذن لقراءة هذا الملف.
bg: Нямате разрешение да прочетете този файл.
ca: No tens permís per llegir aquest fitxer.
cs: Nemáte oprávnění tento soubor číst.
da: Du har ikke tilladelse til at læse denne fil.
de: Du hast keine Berechtigung, diese Datei zu lesen.
el: Δεν έχετε άδεια να διαβάσετε αυτό το αρχείο.
es: No tienes permiso para leer este archivo.
es_419: No tienes permiso para leer este archivo.
fi: Sinulla ei ole oikeuksia lukea tätä tiedostoa.
fr: Vous n'avez pas la permission de lire ce fichier.
fr_ca: Vous n'avez pas la permission de lire ce fichier.
he: אין לך הרשאה לקרוא את הקובץ הזה.
hi: आपके पास इस फ़ाइल को पढ़ने की अनुमति नहीं है।
hr: Nemate dozvolu za čitanje ove datoteke.
hu: Nincs jogosultságod a fájl olvasásához.
id: Anda tidak memiliki izin untuk membaca file ini.
it: Non hai i permessi per leggere questo file.
ja: このファイルを読む権限がありません。
kk: Бұл файлды оқу үшін рұқсатыңыз жоқ.
ko: 이 파일을 읽을 권한이 없습니다.
ms: Anda tidak mempunyai kebenaran untuk membaca fail ini.
nb: Du har ikke tillatelse til å lese denne filen.
nl: Je hebt geen toestemming om dit bestand te lezen.
pl: Nie masz uprawnień do odczytu tego pliku.
pt_br: Você não tem permissão para ler este arquivo.
pt_pt: Não tens permissão para ler este ficheiro.
ro: Nu ai permisiunea de a citi acest fișier.
ru: У вас нет разрешения на чтение этого файла.
sk: Nemáte oprávnenie na čítanie tohto súboru.
sv: Du har inte behörighet att läsa denna fil.
th: คุณไม่มีสิทธิ์ในการอ่านไฟล์นี้
tr: Bu dosyayı okumak için izniniz yok.
uk: У вас немає дозволу на читання цього файлу.
vi: Bạn không có quyền đọc tệp này.
zh_hans: 您没有权限读取此文件。
zh_hant: 您沒有權限讀取此檔案。
zh_hk: 您沒有權限閱讀此文件。

# EnhancedDescriptions.CocoaError.fileWriteOutOfSpace
source: There is not enough disk space to complete the operation.
ar: لا يوجد مساحة كافية على القرص لإتمام العملية.
bg: Няма достатъчно дисково пространство за завършване на операцията.
ca: No hi ha prou espai a disc per completar l'operació.
cs: Není dostatek místa na disku pro dokončení operace.
da: Der er ikke nok diskplads til at fuldføre handlingen.
de: Es ist nicht genügend Speicherplatz vorhanden, um den Vorgang abzuschließen.
el: Δεν υπάρχει αρκετός χώρος στο δίσκο για να ολοκληρωθεί η λειτουργία.
es: No hay suficiente espacio en disco para completar la operación.
es_419: No hay suficiente espacio en disco para completar la operación.
fi: Levytilaa ei ole tarpeeksi toiminnon suorittamiseen.
fr: Il n'y a pas assez d'espace disque pour compléter l'opération.
fr_ca: Il n'y a pas assez d'espace disque pour compléter l'opération.
he: לא קיימת מספיק זיכרון דיסק כדי להשלים את הפעולה.
hi: ऑपरेशन पूरा करने के लिए पर्याप्त डिस्क स्थान नहीं है।
hr: Nema dovoljno prostora na disku za dovršetak operacije.
hu: Nincs elég lemezterület a művelet befejezéséhez.
id: Tidak ada cukup ruang disk untuk menyelesaikan operasi.
it: Non c'è spazio su disco sufficiente per completare l'operazione.
ja: 操作を完了するためのディスクスペースが不足しています。
kk: Операцияны аяқтау үшін жеткілікті дискілік кеңістік жоқ.
ko: 작업을 완료할 디스크 공간이 부족합니다.
ms: Ruang cakera tidak mencukupi untuk menyelesaikan operasi ini.
nb: Det er ikke nok lagringsplass til å fullføre operasjonen.
nl: Er is niet genoeg schijfruimte om de bewerking te voltooien.
pl: Nie ma wystarczającej ilości miejsca na dysku, aby zakończyć operację.
pt_br: Não há espaço em disco suficiente para completar a operação.
pt_pt: Não há espaço em disco suficiente para completar a operação.
ro: Nu există suficient spațiu pe disc pentru a finaliza operațiunea.
ru: Недостаточно дискового пространства для завершения операции.
sk: Nie je dostatok voľného miesta na disku na dokončenie operácie.
sv: Det finns inte tillräckligt med diskutrymme för att slutföra operationen.
th: พื้นที่ดิสก์ไม่เพียงพอในการดำเนินการให้เสร็จสิ้น
tr: İşlemi tamamlamak için yeterli disk alanı yok.
uk: Немає достатньо місця на диску, щоб завершити операцію.
vi: Không đủ dung lượng ổ đĩa để hoàn thành thao tác.
zh_hans: 没有足够的磁盘空间来完成操作。
zh_hant: 磁碟空間不足，無法完成操作。
zh_hk: 磁碟空間不足，無法完成操作。

# EnhancedDescriptions.CoreData.NSManagedObjectValidationError
source: An object validation error occurred.
ar: حدث خطأ في التحقق من صحة الكائن.
bg: Възникна грешка при валидиране на обект.
ca: S'ha produït un error de validació d'objecte.
cs: Došlo k chybě validace objektu.
da: Der opstod en valideringsfejl for et objekt.
de: Ein Objektvalidierungsfehler ist aufgetreten.
el: Παρουσιάστηκε σφάλμα επικύρωσης αντικειμένου.
es: Ocurrió un error de validación de objeto.
es_419: Ocurrió un error de validación del objeto.
fi: Objektin validointivirhe tapahtui.
fr: Une erreur de validation d'objet est survenue.
fr_ca: Une erreur de validation d'objet s'est produite.
he: שגיאת אימות אובייקט התרחשה.
hi: ऑब्जेक्ट वैलिडेशन त्रुटि हुई।
hr: Došlo je do pogreške u validaciji objekta.
hu: Objektum-érvényesítési hiba történt.
id: Terjadi kesalahan validasi objek.
it: Si è verificato un errore di convalida dell'oggetto.
ja: オブジェクトの検証エラーが発生しました。
kk: Объектті валидациялау қатесі орын алды.
ko: 객체 검증 오류가 발생했습니다.
ms: Ralat pengesahan objek berlaku.
nb: Det oppstod en objektvalideringsfeil.
nl: Er is een fout opgetreden bij de objectvalidatie.
pl: Wystąpił błąd walidacji obiektu.
pt_br: Ocorreu um erro de validação do objeto.
pt_pt: Ocorreu um erro de validação de objeto.
ro: A apărut o eroare de validare a obiectului.
ru: Произошла ошибка валидирования объекта.
sk: Došlo k chybe overovania objektu.
sv: Ett objektvalideringsfel inträffade.
th: เกิดข้อผิดพลาดในการตรวจสอบวัตถุ.
tr: Bir nesne doğrulama hatası meydana geldi.
uk: Сталася помилка валідації об'єкта.
vi: Đã xảy ra lỗi xác thực đối tượng.
zh_hans: 发生了对象验证错误。
zh_hant: 發生物件驗證錯誤。
zh_hk: 發生對象驗證錯誤。

# EnhancedDescriptions.CoreData.NSPersistentStoreIncompatibleVersionHashError
source: The data store is incompatible with the current model version.
ar: متجر البيانات غير متوافق مع إصدار النموذج الحالي.
bg: Няма съвместимост между хранилището на данни и текущата версия на модела.
ca: La botiga de dades no és compatible amb la versió del model actual.
cs: Datový sklad je nekompatibilní s aktuální verzí modelu.
da: Databutikken er ikke kompatibel med den nuværende modelversion.
de: Der Datenspeicher ist mit der aktuellen Modellversion inkompatibel.
el: Ο αποθηκευτικός χώρος είναι ασύμβατος με την τρέχουσα έκδοση του μοντέλου.
es: La tienda de datos es incompatible con la versión actual del modelo.
es_419: La tienda de datos es incompatible con la versión del modelo actual.
fi: Tietovarasto ei ole yhteensopiva nykyisen malliversion kanssa.
fr: Le magasin de données est incompatible avec la version actuelle du modèle.
fr_ca: Le magasin de données est incompatible avec la version actuelle du modèle.
he: מאגר הנתונים אינו תואם לגרסה הנוכחית של המודל.
hi: डेटा स्टोर वर्तमान मॉडल संस्करण के साथ असंगत है।
hr: Spremište podataka nije kompatibilno s trenutnom verzijom modela.
hu: Az adattároló inkompatibilis a jelenlegi modellverzióval.
id: Penyimpanan data tidak kompatibel dengan versi model saat ini.
it: Il negozio di dati non è compatibile con la versione attuale del modello.
ja: データストアが現在のモデルバージョンと互換性がありません。
kk: Деректер қорына арналған үлгі нұсқасымен үйлесімсіз.
ko: 데이터 저장소가 현재 모델 버전과 호환되지 않습니다.
ms: Pangkalan data tidak sesuai dengan versi model semasa.
nb: Databutikken er inkompatibel med den nåværende modellversjonen.
nl: De gegevensopslag is incompatibel met de huidige modelversie.
pl: Magazyn danych jest niezgodny z bieżącą wersją modelu.
pt_br: O armazenamento de dados é incompatível com a versão atual do modelo.
pt_pt: A loja de dados é incompatível com a versão atual do modelo.
ro: Magazinul de date este incompatibil cu versiunea actuală a modelului.
ru: Хранилище данных несовместимо с текущей версией модели.
sk: Úložisko údajov nie je kompatibilné s aktuálnou verziou modelu.
sv: Databutiken är inkompatibel med den aktuella modellversionen.
th: ข้อมูลในที่จัดเก็บไม่สามารถใช้งานร่วมกับเวอร์ชันแบบจำลองปัจจุบันได้
tr: Veri deposu mevcut model versiyonu ile uyumsuz.
uk: Сховище даних не сумісне з поточною версією моделі.
vi: Kho dữ liệu không tương thích với phiên bản mô hình hiện tại.
zh_hans: 数据存储与当前模型版本不兼容。
zh_hant: 資料儲存庫與當前模型版本不相容。
zh_hk: 資料存儲與當前模型版本不兼容。
